In [1]:
# Importing
import pandas as pd
import altair as alt
import numpy as np

from IPython.display import Markdown
from IPython.display import display
from tabulate import tabulate
import sqlite3

In [2]:
# Load Dataset
con = sqlite3.connect("lahmansbaseballdb.sqlite")

In [25]:
# Results
# SQL Query
sql = """
SELECT DISTINCT
    c.playerid, c.schoolid, s.teamid, s.yearid, s.salary
FROM
    collegeplaying c
LEFT JOIN salaries AS s ON c.playerid = s.playerid
WHERE c.schoolid = 'idbyuid'
GROUP BY 1, 5
ORDER BY s.salary DESC

"""

df = pd.read_sql_query(sql, con)
print(df.shape)
df

(16, 5)

     playerID schoolID teamID  yearID     salary
0   lindsma01  idbyuid    CHA  2014.0  4000000.0
1   lindsma01  idbyuid    BAL  2012.0  3600000.0
2   lindsma01  idbyuid    COL  2011.0  2800000.0
3   lindsma01  idbyuid    CHA  2013.0  2300000.0
4   lindsma01  idbyuid    HOU  2010.0  1625000.0
5   stephga01  idbyuid    SLN  2001.0  1025000.0
6   stephga01  idbyuid    SLN  2002.0   900000.0
7   stephga01  idbyuid    SLN  2003.0   800000.0
8   stephga01  idbyuid    SLN  2000.0   550000.0
9   lindsma01  idbyuid    FLO  2009.0   410000.0
10  lindsma01  idbyuid    FLO  2008.0   395000.0
11  lindsma01  idbyuid    FLO  2007.0   380000.0
12  stephga01  idbyuid    SLN  1999.0   215000.0
13  stephga01  idbyuid    PHI  1998.0   185000.0
14  stephga01  idbyuid    PHI  1997.0   150000.0
15   catetr01  idbyuid   None     NaN        NaN